rails-5/rails-chats-api/app/controllers/profiles_controller.rb

  def update
    if @current_user.update(profile_params)
---
UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "new_test1@example.com"], ["password_digest", "$2a$10$vSSzPFZOha13t5weNdXOXO/YumNKhX1UBucRExq2e/k0ifzwxEXHm"], ["updated_at", "2017-09-27 09:09:41.518534"], ["id", 1]]

  def destroy
    if @current_user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]

  def set_profile
    @current_user = User.includes(:auth_token).find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "auth_tokens".* FROM "auth_tokens" WHERE "auth_tokens"."user_id" = 3