rails-5/rails-chats-api/app/controllers/sessions_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
SELECT  "auth_tokens".* FROM "auth_tokens" WHERE "auth_tokens"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
  def create
    @current_user = User.new(session_params)

    if @current_user.save
      render json: { api_token: @current_user.auth_token.value }.to_json

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]
---
  def destroy
    if @current_user.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "auth_tokens".* FROM "auth_tokens" WHERE "auth_tokens"."user_id" = 3
---
  def set_session
    @current_user = User.includes(:auth_token).find(params[:id])